{
  "backToHome": "Zurück zur Startseite",
  "privacyPolicy": "Datenschutz",
  "imprint": "Impressum",
  "home": "Startseite",
  "lastUpdated": "Zuletzt aktualisiert",
  "languageLabel": "Sprache",

  "imprint.title": "Impressum",
  "imprint.companyInfo.title": "Angaben gemäß EU-Verordnung",
  "imprint.companyInfo.country": "Zypern",
  "imprint.companyInfo.tradeRegister": "Handelsregister",
  "imprint.companyInfo.registeredIn": "Registriert in Zypern",
  "imprint.representative.title": "Vertretungsberechtigte Geschäftsführung",
  "imprint.contact.title": "Kontakt",
  "imprint.brand.title": "Produkt / Marke",
  "imprint.brand.desc": "ist ein Produkt und eine Marke der MYFAMBLISS GROUP LTD.",
  "imprint.contentResponsible.title": "Verantwortlich für den Inhalt",
  "imprint.dispute.title": "EU-Streitschlichtung",
  "imprint.dispute.intro": "Die Europäische Kommission stellt eine Plattform zur Online-Streitbeilegung (OS) bereit:",
  "imprint.dispute.note": "Unsere E-Mail-Adresse finden Sie oben im Impressum. Wir sind nicht bereit oder verpflichtet, an Streitbeilegungsverfahren vor einer Verbraucherschlichtungsstelle teilzunehmen.",
  "imprint.liability.title": "Haftung für Inhalte",
  "imprint.liability.text": "Als Diensteanbieter sind wir für eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich. Wir sind jedoch nicht verpflichtet, übermittelte oder gespeicherte fremde Informationen zu überwachen oder nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen. Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon unberührt. Eine diesbezügliche Haftung ist jedoch erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung möglich. Bei Bekanntwerden von entsprechenden Rechtsverletzungen werden wir diese Inhalte umgehend entfernen.",
  "imprint.liabilityLinks.title": "Haftung für Links",
  "imprint.liabilityLinks.text": "Unser Angebot enthält Links zu externen Websites Dritter, auf deren Inhalte wir keinen Einfluss haben. Deshalb können wir für diese fremden Inhalte auch keine Gewähr übernehmen. Für die Inhalte der verlinkten Seiten ist stets der jeweilige Anbieter oder Betreiber der Seiten verantwortlich. Die verlinkten Seiten wurden zum Zeitpunkt der Verlinkung auf mögliche Rechtsverstöße überprüft. Rechtswidrige Inhalte waren zum Zeitpunkt der Verlinkung nicht erkennbar. Eine permanente inhaltliche Kontrolle der verlinkten Seiten ist jedoch ohne konkrete Anhaltspunkte einer Rechtsverletzung nicht zumutbar. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Links umgehend entfernen.",
  "imprint.copyright.title": "Urheberrecht",
  "imprint.copyright.text": "Die durch die Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechtes bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers. Downloads und Kopien dieser Seite sind nur für den privaten, nicht kommerziellen Gebrauch gestattet. Soweit die Inhalte auf dieser Seite nicht vom Betreiber erstellt wurden, werden die Urheberrechte Dritter beachtet. Insbesondere werden Inhalte Dritter als solche gekennzeichnet. Sollten Sie trotzdem auf eine Urheberrechtsverletzung aufmerksam werden, bitten wir um einen entsprechenden Hinweis. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Inhalte umgehend entfernen.",

  "terms": "Nutzungsbedingungen",
  "terms.title": "Allgemeine Geschäftsbedingungen (AGB)",
  "terms.scope.title": "1. Geltungsbereich und Anbieter",
  "terms.scope.text": "Diese Allgemeinen Geschäftsbedingungen (\"AGB\") regeln die Nutzung der Trackbliss-Plattform (\"Dienst\"), betrieben von MYFAMBLISS GROUP LTD, Gladstonos 12-14, 8042 Paphos, Zypern (\"Anbieter\", \"wir\"). Mit der Registrierung oder Nutzung des Dienstes stimmen Sie diesen AGB zu. Der Dienst ist eine webbasierte SaaS-Plattform zur Erstellung und Verwaltung Digitaler Produktpässe (DPPs) gemäß EU-Verordnungen.",
  "terms.registration.title": "2. Registrierung und Benutzerkonto",
  "terms.registration.text": "Zur Nutzung des Dienstes müssen Sie sich mit einer gültigen E-Mail-Adresse registrieren und ein sicheres Passwort erstellen. Sie sind für die Geheimhaltung Ihrer Zugangsdaten und für alle Aktivitäten verantwortlich, die unter Ihrem Konto stattfinden. Sie müssen bei der Registrierung korrekte und vollständige Angaben machen und diese aktuell halten. Wir behalten uns das Recht vor, Konten zu sperren oder zu löschen, die gegen diese AGB verstoßen.",
  "terms.services.title": "3. Leistungsbeschreibung",
  "terms.services.text": "Trackbliss bietet Tools zur Verwaltung Digitaler Produktpässe, KI-gestützte Compliance-Analyse, Lieferketten-Transparenz, Retourenmanagement (über Zusatzmodule) und verwandte Dienste. Die verfügbaren Funktionen hängen von Ihrem gewählten Plan (Free, Pro oder Enterprise) und etwaigen Zusatzmodulen ab. Wir behalten uns das Recht vor, Funktionen mit angemessener Vorankündigung zu ändern, zu erweitern oder einzustellen. Die angestrebte Verfügbarkeit beträgt 99,5% Uptime, ausgenommen geplante Wartungsarbeiten.",
  "terms.obligations.title": "4. Pflichten des Nutzers",
  "terms.obligations.text": "Sie verpflichten sich, den Dienst nur für rechtmäßige Zwecke und in Übereinstimmung mit diesen AGB zu nutzen. Sie dürfen nicht: (a) den Dienst zur Speicherung oder Übertragung von Schadcode nutzen; (b) versuchen, unbefugten Zugang zum Dienst oder seiner Infrastruktur zu erlangen; (c) den Dienst ohne schriftliche Zustimmung weiterverkaufen, unterlizenzieren oder weiterverbreiten; (d) Inhalte hochladen, die Rechte Dritter am geistigen Eigentum verletzen; (e) den Dienst in einer Weise nutzen, die dessen Betrieb beschädigen, deaktivieren oder beeinträchtigen könnte.",
  "terms.billing.title": "5. Preise und Zahlung",
  "terms.billing.text": "Der Free-Plan wird kostenlos mit eingeschränkten Funktionen angeboten. Bezahlte Pläne (Pro, Enterprise) und Zusatzmodule werden monatlich oder jährlich abgerechnet. Alle Preise sind in EUR und verstehen sich zuzüglich der geltenden Mehrwertsteuer. Die Zahlung erfolgt über Stripe. Mit dem Abschluss eines kostenpflichtigen Plans ermächtigen Sie wiederkehrende Abbuchungen. Sie können jederzeit kündigen; die Kündigung wird zum Ende des aktuellen Abrechnungszeitraums wirksam. Erstattungen für angefangene Abrechnungszeiträume werden nicht gewährt. Wir behalten uns das Recht vor, Preise mit 30 Tagen Vorankündigung anzupassen.",
  "terms.intellectualProperty.title": "6. Geistiges Eigentum",
  "terms.intellectualProperty.text": "Der Dienst, einschließlich Design, Code, Dokumentation und Branding, ist geistiges Eigentum des Anbieters. Sie behalten das Eigentum an allen Daten und Inhalten, die Sie in den Dienst hochladen. Durch die Nutzung des Dienstes gewähren Sie uns eine eingeschränkte Lizenz zur Verarbeitung Ihrer Daten ausschließlich zum Zweck der Bereitstellung des Dienstes. Wir beanspruchen kein Eigentum an Ihren Produktdaten, DPP-Inhalten oder Geschäftsinformationen.",
  "terms.dataProtection.title": "7. Datenschutz",
  "terms.dataProtection.text": "Wir verarbeiten personenbezogene Daten gemäß unserer Datenschutzerklärung und den geltenden Datenschutzgesetzen, insbesondere der EU-Datenschutz-Grundverordnung (DSGVO). Mit der Nutzung des Dienstes bestätigen Sie, dass Sie unsere Datenschutzerklärung gelesen und verstanden haben. Für die KI-gestützte Compliance-Analyse werden Produktdaten (keine personenbezogenen Daten) an Drittanbieter übermittelt. Daten werden auf EU-Servern mit Row-Level Security für Mandantentrennung gespeichert.",
  "terms.liability.title": "8. Haftungsbeschränkung",
  "terms.liability.text": "Der Dienst wird \"wie besehen\" ohne jegliche Gewährleistung bereitgestellt. Wir garantieren nicht, dass die KI-Compliance-Analyse fehlerfrei ist oder professionelle Rechtsberatung ersetzt. Unsere Gesamthaftung ist auf den Betrag begrenzt, den Sie in den 12 Monaten vor dem Anspruch für den Dienst gezahlt haben. Wir haften nicht für indirekte, zufällige oder Folgeschäden. Diese Beschränkung gilt nicht bei Vorsatz oder grober Fahrlässigkeit.",
  "terms.termination.title": "9. Kündigung",
  "terms.termination.text": "Jede Partei kann die Vereinbarung jederzeit kündigen. Sie können Ihr Konto über die Diensteinstellungen löschen. Nach Kündigung werden Ihre Daten 30 Tage aufbewahrt, um einen Export zu ermöglichen, danach werden sie dauerhaft gelöscht (vorbehaltlich gesetzlicher Aufbewahrungspflichten). Wir können Ihr Konto bei wesentlichem Verstoß gegen diese AGB sofort kündigen.",
  "terms.changes.title": "10. Änderungen dieser AGB",
  "terms.changes.text": "Wir behalten uns das Recht vor, diese AGB jederzeit zu ändern. Wesentliche Änderungen werden per E-Mail oder In-App-Benachrichtigung mindestens 30 Tage vor Inkrafttreten mitgeteilt. Die weitere Nutzung des Dienstes nach dem Inkrafttreten gilt als Zustimmung zu den geänderten AGB. Wenn Sie den Änderungen nicht zustimmen, können Sie Ihr Konto vor dem Inkrafttreten kündigen.",
  "terms.severability.title": "11. Salvatorische Klausel",
  "terms.severability.text": "Sollte eine Bestimmung dieser AGB unwirksam oder undurchsetzbar sein, bleiben die übrigen Bestimmungen in vollem Umfang gültig. Die unwirksame Bestimmung wird durch eine gültige Bestimmung ersetzt, die dem ursprünglichen Zweck am nächsten kommt.",
  "terms.governing.title": "12. Anwendbares Recht und Gerichtsstand",
  "terms.governing.text": "Diese AGB unterliegen dem Recht der Republik Zypern. Für Streitigkeiten aus oder im Zusammenhang mit diesen AGB sind ausschließlich die Gerichte in Paphos, Zypern zuständig. Für Verbraucher innerhalb der EU können zwingende Verbraucherschutzvorschriften ihres Wohnsitzlandes gelten.",

  "privacy.title": "Datenschutzerklärung",
  "privacy.1.title": "1. Verantwortlicher",
  "privacy.1.intro": "Verantwortlich für die Datenverarbeitung auf dieser Website ist die MYFAMBLISS GROUP LTD (nachfolgend „wir“, „uns“ oder „Verantwortlicher“). Trackbliss ist ein Produkt und eine Marke der MYFAMBLISS GROUP LTD.",
  "privacy.2.title": "2. Überblick über die Datenverarbeitung",
  "privacy.2.text": "Wir nehmen den Schutz Ihrer persönlichen Daten sehr ernst. Wir behandeln Ihre personenbezogenen Daten vertraulich und entsprechend der gesetzlichen Datenschutzvorschriften, insbesondere der Datenschutz-Grundverordnung (DSGVO) der Europäischen Union, sowie dieser Datenschutzerklärung.",
  "privacy.3.title": "3. Rechtsgrundlagen der Verarbeitung",
  "privacy.3.intro": "Die Verarbeitung personenbezogener Daten erfolgt auf Grundlage folgender Rechtsgrundlagen:",
  "privacy.3.a": "Art. 6 Abs. 1 lit. a DSGVO",
  "privacy.3.a.desc": "Einwilligung der betroffenen Person",
  "privacy.3.b": "Art. 6 Abs. 1 lit. b DSGVO",
  "privacy.3.b.desc": "Erfüllung eines Vertrages oder vorvertragliche Maßnahmen",
  "privacy.3.c": "Art. 6 Abs. 1 lit. c DSGVO",
  "privacy.3.c.desc": "Erfüllung einer rechtlichen Verpflichtung",
  "privacy.3.f": "Art. 6 Abs. 1 lit. f DSGVO",
  "privacy.3.f.desc": "Berechtigtes Interesse des Verantwortlichen",
  "privacy.4.title": "4. Hosting und technische Infrastruktur",
  "privacy.4a.title": "a) Vercel (Hosting)",
  "privacy.4a.text": "Diese Website wird bei Vercel Inc., 340 S Lemon Ave #4133, Walnut, CA 91789, USA gehostet. Vercel verarbeitet dabei technisch notwendige Daten wie IP-Adressen, die zur Auslieferung der Website erforderlich sind. Die Verarbeitung erfolgt auf Grundlage unseres berechtigten Interesses (Art. 6 Abs. 1 lit. f DSGVO) an einer sicheren und effizienten Bereitstellung unseres Onlineangebotes. Vercel ist unter dem EU-U.S. Data Privacy Framework zertifiziert.",
  "privacy.4b.title": "b) Supabase (Backend & Datenbank)",
  "privacy.4b.text": "Für die Backend-Infrastruktur und Datenbankdienste nutzen wir Supabase Inc., 970 Toa Payoh North #07-04, Singapore 318992. Supabase verarbeitet die zur Nutzung unserer Dienste erforderlichen Daten (Benutzerkontodaten, Produktdaten, Geschäftsdaten). Die Datenverarbeitung erfolgt auf Grundlage der Vertragserfüllung (Art. 6 Abs. 1 lit. b DSGVO). Die Daten werden auf Servern in der EU (Frankfurt, Deutschland) gespeichert.",
  "privacy.5.title": "5. Datenerfassung auf dieser Website",
  "privacy.5a.title": "a) Server-Log-Dateien",
  "privacy.5a.intro": "Der Provider der Seiten erhebt und speichert automatisch Informationen in sogenannten Server-Log-Dateien, die Ihr Browser automatisch an uns übermittelt. Dies sind:",
  "privacy.5a.item1": "Browsertyp und Browserversion",
  "privacy.5a.item2": "Verwendetes Betriebssystem",
  "privacy.5a.item3": "Referrer URL",
  "privacy.5a.item4": "Hostname des zugreifenden Rechners",
  "privacy.5a.item5": "IP-Adresse",
  "privacy.5a.item6": "Uhrzeit der Serveranfrage",
  "privacy.5a.note": "Diese Daten werden nicht mit anderen Datenquellen zusammengeführt. Die Erfassung erfolgt auf Grundlage von Art. 6 Abs. 1 lit. f DSGVO.",
  "privacy.5b.title": "b) Cookies und Local Storage",
  "privacy.5b.text": "Unsere Website verwendet technisch notwendige Cookies und Local Storage für die Authentifizierung, Spracheinstellungen und Sitzungsverwaltung. Diese sind für den Betrieb der Website unbedingt erforderlich und können nicht deaktiviert werden. Es werden keine Tracking- oder Marketing-Cookies eingesetzt.",
  "privacy.6.title": "6. Benutzerkonto und Registrierung",
  "privacy.6.intro": "Bei der Registrierung für unseren Dienst Trackbliss erheben wir folgende Daten:",
  "privacy.6.item1": "E-Mail-Adresse",
  "privacy.6.item2": "Passwort (verschlüsselt gespeichert)",
  "privacy.6.item3": "Vor- und Nachname",
  "privacy.6.item4": "Unternehmensdaten (Name, Adresse, Branche)",
  "privacy.6.note": "Die Verarbeitung erfolgt zur Vertragserfüllung (Art. 6 Abs. 1 lit. b DSGVO). Die Daten werden für die Dauer der Nutzung unseres Dienstes gespeichert und nach Vertragsende und Ablauf gesetzlicher Aufbewahrungsfristen gelöscht.",
  "privacy.7.title": "7. Verarbeitete Geschäftsdaten",
  "privacy.7.intro": "Im Rahmen der Nutzung von Trackbliss verarbeiten wir folgende Geschäftsdaten unserer Kunden:",
  "privacy.7.item1": "Produktdaten (Digitale Produktpässe, GTIN, Seriennummern, Materialien, Zertifizierungen)",
  "privacy.7.item2": "Lieferkettendaten (Lieferanten, Herstellungsstandorte, Transportwege)",
  "privacy.7.item3": "Compliance-Daten (Prüfberichte, Zertifikate, ESPR-Konformität)",
  "privacy.7.item4": "Retourendaten (Retourengründe, Kundendaten, Ticketverlauf)",
  "privacy.7.item5": "Dokumente (hochgeladene Zertifikate, Berichte, Bilder)",
  "privacy.7.note": "Diese Daten werden ausschließlich zur Erbringung unserer vertraglichen Leistungen verarbeitet (Art. 6 Abs. 1 lit. b DSGVO) und mit Mandantentrennung (Multi-Tenant) gespeichert, sodass nur der jeweilige Mandant Zugriff auf seine Daten hat.",
  "privacy.8.title": "8. KI-gestützte Compliance-Analyse",
  "privacy.8.text": "Trackbliss bietet eine KI-gestützte Compliance-Analyse an. Dabei werden Produktdaten über die OpenRouter API an das KI-Modell Claude (Anthropic) übermittelt. Die Übermittlung erfolgt verschlüsselt. Es werden ausschließlich Geschäftsdaten (Produktinformationen, Materialien, Zertifizierungen) übermittelt — keine personenbezogenen Daten von Endkunden. Die Rechtsgrundlage ist Art. 6 Abs. 1 lit. b DSGVO (Vertragserfüllung) bzw. Art. 6 Abs. 1 lit. a DSGVO (Einwilligung), da die Analyse aktiv vom Nutzer gestartet wird.",
  "privacy.9.title": "9. E-Mail-Benachrichtigungen",
  "privacy.9.text": "Für den Versand transaktionaler E-Mails (Retourenbestätigungen, Ticketbenachrichtigungen, Einladungen) nutzen wir den Dienst Resend (Resend Inc., USA). E-Mail-Adressen der Empfänger werden an Resend übermittelt, soweit dies für den E-Mail-Versand erforderlich ist. Die Rechtsgrundlage ist Art. 6 Abs. 1 lit. b DSGVO (Vertragserfüllung).",
  "privacy.10.title": "10. Datenübermittlung in Drittländer",
  "privacy.10.intro": "Im Rahmen unserer Datenverarbeitung können Daten in folgende Drittländer übermittelt werden:",
  "privacy.10.table.service": "Dienst",
  "privacy.10.table.country": "Land",
  "privacy.10.table.safeguard": "Garantie",
  "privacy.10.table.supabaseCountry": "EU (Frankfurt)",
  "privacy.10.table.supabaseSafeguard": "Keine Drittlandübermittlung",
  "privacy.11.title": "11. Ihre Rechte als betroffene Person",
  "privacy.11.intro": "Sie haben gegenüber uns folgende Rechte hinsichtlich der Sie betreffenden personenbezogenen Daten:",
  "privacy.11.access": "Recht auf Auskunft",
  "privacy.11.rectification": "Recht auf Berichtigung",
  "privacy.11.erasure": "Recht auf Löschung",
  "privacy.11.restriction": "Recht auf Einschränkung der Verarbeitung",
  "privacy.11.portability": "Recht auf Datenübertragbarkeit",
  "privacy.11.object": "Widerspruchsrecht",
  "privacy.11.withdraw": "Recht auf Widerruf der Einwilligung",
  "privacy.11.contact": "Zur Ausübung Ihrer Rechte wenden Sie sich bitte an: info@myfamblissgroup.com",
  "privacy.12.title": "12. Beschwerderecht bei einer Aufsichtsbehörde",
  "privacy.12.text": "Sie haben das Recht, sich bei einer Datenschutz-Aufsichtsbehörde über die Verarbeitung Ihrer personenbezogenen Daten durch uns zu beschweren. Die zuständige Aufsichtsbehörde für Zypern ist:",
  "privacy.12.authority": "Beauftragte für den Schutz personenbezogener Daten",
  "privacy.12.country": "Zypern",
  "privacy.13.title": "13. Datensicherheit",
  "privacy.13.intro": "Wir setzen technische und organisatorische Sicherheitsmaßnahmen ein, um Ihre Daten gegen Manipulation, Verlust, Zerstörung und gegen den Zugriff durch unbefugte Personen zu schützen. Unsere Sicherheitsmaßnahmen umfassen insbesondere:",
  "privacy.13.item1": "SSL/TLS-Verschlüsselung aller Datenübertragungen",
  "privacy.13.item2": "Row Level Security (RLS) für Mandantentrennung auf Datenbankebene",
  "privacy.13.item3": "Verschlüsselte Passwortspeicherung (bcrypt)",
  "privacy.13.item4": "Rollenbasierte Zugriffskontrolle (RBAC)",
  "privacy.13.item5": "Regelmäßige Sicherheitsupdates und Überprüfungen",
  "privacy.14.title": "14. Speicherdauer",
  "privacy.14.text": "Personenbezogene Daten werden nur so lange gespeichert, wie es für den jeweiligen Verarbeitungszweck erforderlich ist oder gesetzliche Aufbewahrungsfristen bestehen. Kontodaten werden nach Kündigung und Ablauf etwaiger gesetzlicher Aufbewahrungsfristen (in der Regel 6–10 Jahre für steuerrechtlich relevante Daten) gelöscht. Server-Log-Dateien werden nach maximal 30 Tagen automatisch gelöscht.",
  "privacy.15.title": "15. Änderungen dieser Datenschutzerklärung",
  "privacy.15.text": "Wir behalten uns vor, diese Datenschutzerklärung anzupassen, damit sie stets den aktuellen rechtlichen Anforderungen entspricht oder um Änderungen unserer Leistungen in der Datenschutzerklärung umzusetzen. Für Ihren erneuten Besuch gilt dann die neue Datenschutzerklärung."
}
