{
  "title": "Schulungsguide",
  "subtitle": "Lernen Sie Schritt für Schritt, wie Sie Trackbliss verwenden — vom Dashboard bis zur Abrechnung.",
  "progress": "Ihr Fortschritt",
  "completed": "Abgeschlossen",
  "of": "von",
  "chapters": "Kapitel",
  "markComplete": "Als abgeschlossen markieren",
  "goToPage": "Zur Seite",
  "expandAll": "Alle aufklappen",
  "collapseAll": "Alle zuklappen",
  "tip": "Tipp",
  "shortcut": "Shortcut",
  "important": "Wichtig",
  "note": "Hinweis",
  "allComplete": "Herzlichen Glückwunsch! Sie haben den gesamten Guide abgeschlossen.",

  "dashboard.title": "Dashboard",
  "dashboard.subtitle": "Ihre Kommandozentrale für Digitale Produktpässe",
  "dashboard.step1.title": "KPIs verstehen",
  "dashboard.step1.description": "Das Dashboard zeigt die wichtigsten Kennzahlen auf einen Blick.",
  "dashboard.step1.detail": "Sie sehen die Gesamtanzahl Ihrer Produkte, den durchschnittlichen Compliance-Score, die Anzahl offener Retouren und ausstehende Dokumente. Jede KPI-Karte zeigt zudem die Veränderung im Vergleich zum Vormonat mit einem farbcodierten Trend-Indikator an.",
  "dashboard.step2.title": "Seitenleiste navigieren",
  "dashboard.step2.description": "Die linke Seitenleiste ist Ihr Hauptnavigationselement für alle Bereiche.",
  "dashboard.step2.detail": "Die Seitenleiste gruppiert alle Funktionen: Produkte, DPP, Dokumente, Lieferkette, Compliance, Returns Hub und Einstellungen. Klicken Sie auf einen Menüpunkt, um den jeweiligen Bereich zu öffnen. Die Seitenleiste kann auf kleinen Bildschirmen eingeklappt werden.",
  "dashboard.step3.title": "Schnellaktionen nutzen",
  "dashboard.step3.description": "Häufig genutzte Aktionen sind direkt vom Dashboard aus erreichbar.",
  "dashboard.step3.detail": "Über die Schnellaktions-Buttons können Sie direkt ein neues Produkt anlegen, ein Dokument hochladen oder eine AI-Compliance-Prüfung starten — ohne den Umweg über die Navigation. Diese Aktionen sparen Zeit bei täglichen Aufgaben.",
  "dashboard.step4.title": "Diagramme analysieren",
  "dashboard.step4.description": "Interaktive Diagramme visualisieren Trends und Verteilungen.",
  "dashboard.step4.detail": "Das Dashboard enthält Diagramme für Compliance-Score-Entwicklung über die Zeit, Produktkategorien-Verteilung und Retouren-Statistiken. Fahren Sie mit der Maus über Datenpunkte, um detaillierte Werte zu sehen. Die Zeiträume können über Dropdown-Filter angepasst werden.",
  "dashboard.step5.title": "Sprache wechseln",
  "dashboard.step5.description": "Trackbliss unterstützt Deutsch und Englisch — wechseln Sie jederzeit.",
  "dashboard.step5.detail": "Klicken Sie auf das Sprach-Symbol in der oberen rechten Ecke der Kopfzeile, um zwischen Deutsch und Englisch zu wechseln. Die Einstellung wird lokal gespeichert und bleibt beim nächsten Login erhalten. Alle Oberflächen-Texte, Labels und Meldungen werden sofort in der gewählten Sprache angezeigt.",
  "dashboard.tip1": "Nutzen Sie die Tastenkombination Strg+K (oder Cmd+K auf Mac), um die Befehlspalette zu öffnen. Damit können Sie blitzschnell zu jeder Seite navigieren oder Aktionen ausführen.",
  "dashboard.link": "/",

  "products.title": "Produkte",
  "products.subtitle": "Produkte anlegen, verwalten und mit DPP-Daten anreichern",
  "products.step1.title": "Neues Produkt anlegen",
  "products.step1.description": "Erstellen Sie Ihr erstes Produkt mit allen Stammdaten.",
  "products.step1.detail": "Navigieren Sie zu Produkte → Neues Produkt. Füllen Sie die Pflichtfelder aus: Produktname, GTIN (EAN/UPC-Barcode), Kategorie und Hersteller. Optional können Sie direkt eine Beschreibung, Materialien und Nachhaltigkeitsinformationen ergänzen. Klicken Sie auf 'Speichern', um das Produkt anzulegen.",
  "products.step2.title": "Kategorien verwalten",
  "products.step2.description": "Organisieren Sie Ihre Produkte in übersichtliche Kategorien.",
  "products.step2.detail": "Unter Produkte → Kategorien können Sie eigene Produktkategorien erstellen und verwalten. Jede Kategorie kann einen Namen, eine Beschreibung und ein Icon erhalten. Kategorien helfen bei der Filterung in der Produktliste und beeinflussen die AI-Compliance-Bewertung, da unterschiedliche Produktkategorien unterschiedlichen Regulierungen unterliegen.",
  "products.step3.title": "Produkt-Tabs verstehen",
  "products.step3.description": "Jedes Produkt hat mehrere Tabs für verschiedene Datenbereiche.",
  "products.step3.detail": "Die Produktdetailseite ist in Tabs organisiert: Übersicht (Stammdaten), Materialien & Nachhaltigkeit, Zertifizierungen, Lieferkette, Dokumente, Bilder, ESPR-Compliance und AI-Compliance-Check. Jeder Tab fokussiert sich auf einen bestimmten Aspekt des Digitalen Produktpasses.",
  "products.step4.title": "Chargen (Batches) erstellen",
  "products.step4.description": "Verwalten Sie Produktvarianten und Seriennummern über Chargen.",
  "products.step4.detail": "Innerhalb eines Produkts können Sie Chargen anlegen. Jede Charge hat eine eigene Chargennummer, Seriennummern, Produktionsdatum und Status. Chargen ermöglichen die Rückverfolgbarkeit einzelner Produktionslose. Navigieren Sie zum Produkt und klicken Sie auf 'Neue Charge', um eine Charge mit automatisch generierten oder manuell eingegebenen Seriennummern zu erstellen.",
  "products.step5.title": "ESPR-Felder ausfüllen",
  "products.step5.description": "Erfüllen Sie die EU-ESPR 2024/1781 Verordnung mit den speziellen Compliance-Feldern.",
  "products.step5.detail": "Im Tab 'ESPR-Compliance' finden Sie 21 Pflichtfelder der EU-Ökodesign-Verordnung, unterteilt in 6 Bereiche: Wirtschaftsakteure (Hersteller, Importeur, Händler), SVHC-Erklärung (besonders besorgniserregende Stoffe), Haltbarkeit & Reparierbarkeit, Konformitätsbewertung, Sicherheitshinweise und Produktregister (EPREL, SCIP). Füllen Sie so viele Felder wie möglich aus, um Ihren Compliance-Score zu maximieren.",
  "products.step6.title": "Produktbilder hochladen",
  "products.step6.description": "Laden Sie Produktfotos hoch, die im öffentlichen DPP angezeigt werden.",
  "products.step6.detail": "Im Tab 'Bilder' können Sie mehrere Produktfotos hochladen. Ziehen Sie Bilder per Drag-and-Drop in den Upload-Bereich oder klicken Sie auf 'Bilder hochladen'. Sie können die Reihenfolge per Drag-and-Drop ändern, ein Hauptbild festlegen und optionale Bildunterschriften hinzufügen. Unterstützte Formate: JPG, PNG, WebP (max. 10 MB pro Bild).",
  "products.step7.title": "Dokumente verknüpfen",
  "products.step7.description": "Verknüpfen Sie Zertifikate und Berichte mit Ihren Produkten.",
  "products.step7.detail": "Im Tab 'Dokumente' sehen Sie alle mit dem Produkt verknüpften Dateien. Klicken Sie auf 'Dokument hinzufügen', um ein bereits hochgeladenes Dokument zuzuweisen, oder laden Sie ein neues Dokument direkt hoch. Dokumenttypen wie CE-Konformitätserklärungen, Testberichte und Sicherheitsdatenblätter verbessern den Compliance-Score erheblich.",
  "products.tip1": "Verwenden Sie die GTIN (Global Trade Item Number) konsequent — sie ist der Schlüssel für die eindeutige Produktidentifikation im GS1 Digital Link und wird im QR-Code codiert.",
  "products.tip2": "Legen Sie Chargen für verschiedene Produktionslose an, um einzelne Einheiten über Seriennummern rückverfolgen zu können. Jede Kombination aus GTIN und Seriennummer erzeugt einen eindeutigen DPP-Link.",
  "products.link": "/products",

  "dpp.title": "Digitaler Produktpass",
  "dpp.subtitle": "DPP-Seiten gestalten, QR-Codes generieren und Sichtbarkeit steuern",
  "dpp.step1.title": "DPP-Übersicht kennenlernen",
  "dpp.step1.description": "Die DPP-Übersichtsseite zeigt alle Ihre Digitalen Produktpässe.",
  "dpp.step1.detail": "Unter DPP → Übersicht sehen Sie eine Liste aller Produkte mit ihren DPP-Links, QR-Codes und dem aktuellen Status. Von hier aus können Sie direkt zur öffentlichen DPP-Seite navigieren, QR-Codes herunterladen oder die Sichtbarkeitseinstellungen anpassen.",
  "dpp.step2.title": "Template auswählen",
  "dpp.step2.description": "Wählen Sie aus 11 Design-Vorlagen die passende für Ihre Marke.",
  "dpp.step2.detail": "Trackbliss bietet 11 DPP-Templates: Modern, Classic, Compact, Minimal, Technical, Eco-Friendly, Premium, Government, Retail, Scientific und Accessible. Jedes Template hat ein eigenes Layout und einen eigenen Stil. Navigieren Sie zu Einstellungen → Branding → DPP-Design, um Templates in der Live-Vorschau zu vergleichen und Ihr bevorzugtes Template zu aktivieren.",
  "dpp.step3.title": "Design anpassen",
  "dpp.step3.description": "Passen Sie Farben, Typografie, Hero-Bereich und Karten an Ihr Branding an.",
  "dpp.step3.detail": "Im DPP-Design-Editor können Sie jeden Aspekt individualisieren: Primär-, Sekundär- und Akzentfarbe, Schriftart und -größe, Hero-Stil (Gradient, Bild, Solid, Minimal), Karten-Aussehen (Eckenradius, Schatten, Rahmen) sowie die Reihenfolge und Sichtbarkeit der Sektionen. Nutzen Sie eines der 6 Farbpresets (Ocean, Forest, Sunset, Midnight, Corporate, Minimal) als Ausgangspunkt.",
  "dpp.step4.title": "QR-Codes generieren",
  "dpp.step4.description": "Erstellen Sie druckfertige QR-Codes für Ihre Produkte.",
  "dpp.step4.detail": "Unter DPP → QR-Generator können Sie QR-Codes für einzelne Produkte oder ganze Chargen erstellen. Passen Sie die QR-Code-Einstellungen an: Größe, Fehlerkorrektur-Level, Vorder- und Hintergrundfarbe sowie optionales Logo in der Mitte. Die QR-Codes verwenden den GS1 Digital Link Standard (/01/{GTIN}/21/{Serial}) und können als PNG oder SVG heruntergeladen werden.",
  "dpp.step5.title": "Sichtbarkeit konfigurieren",
  "dpp.step5.description": "Steuern Sie, welche Felder für Verbraucher, Zoll und intern sichtbar sind.",
  "dpp.step5.detail": "Das dreistufige Sichtbarkeitssystem (V2) umfasst 36 Felder in 9 Kategorien. Für jedes Feld wählen Sie eine Stufe: 'Verbraucher' (öffentlich sichtbar), 'Zoll' (nur für Zollbeamte + Admin) oder 'Intern' (nur für Admins). Einstellungen können global für den gesamten Mandanten oder pro Produkt individuell festgelegt werden. Produktspezifische Einstellungen überschreiben die Mandanten-Vorgaben.",
  "dpp.step6.title": "DPP-URLs verstehen",
  "dpp.step6.description": "Jedes Produkt hat zwei URL-Formate für den öffentlichen Zugriff.",
  "dpp.step6.detail": "Trackbliss unterstützt zwei URL-Formate: das lokale Format /p/{GTIN}/{Serial} und den GS1 Digital Link Standard /01/{GTIN}/21/{Serial}. Beide führen zur selben öffentlichen DPP-Seite. Der GS1 Digital Link ist der internationale Standard und wird für die Verwendung in QR-Codes empfohlen, da er von GS1-kompatiblen Scannern automatisch aufgelöst werden kann.",
  "dpp.step7.title": "Zoll-Ansicht nutzen",
  "dpp.step7.description": "Die spezielle Zoll-Ansicht zeigt erweiterte Handels- und Compliance-Daten.",
  "dpp.step7.detail": "Durch Anhängen von /customs an die DPP-URL wird die Zoll-Ansicht aktiviert. Diese zeigt zusätzliche Felder wie HS-Code, Ursprungsland, Netto-/Bruttogewicht, Herstelleradresse, EORI-Nummer und USt-IdNr. Die Zoll-Ansicht ist für Zollbehörden und Handelspartner gedacht und zeigt alle Felder mit Sichtbarkeitsstufe 'Zoll' oder 'Verbraucher'.",
  "dpp.tip1": "Testen Sie die öffentliche DPP-Seite regelmäßig, indem Sie den QR-Code mit Ihrem Smartphone scannen. So sehen Sie genau, was Ihre Kunden und Partner sehen.",
  "dpp.tip2": "Nutzen Sie das 'Accessible'-Template, wenn Sie WCAG-AA-konforme DPP-Seiten mit hohem Kontrast, großer Schrift und semantischem HTML benötigen.",
  "dpp.link": "/dpp",

  "documents.title": "Dokumente",
  "documents.subtitle": "Zertifikate, Berichte und Nachweise zentral verwalten",
  "documents.step1.title": "Dokument hochladen",
  "documents.step1.description": "Laden Sie Zertifikate, Testberichte und andere Nachweise hoch.",
  "documents.step1.detail": "Navigieren Sie zu Dokumente → Hochladen. Ziehen Sie Dateien per Drag-and-Drop in den Upload-Bereich oder klicken Sie auf 'Dateien auswählen'. Unterstützte Formate sind PDF, JPG, PNG und weitere gängige Dokumentformate (max. 50 MB pro Datei). Geben Sie einen aussagekräftigen Namen und eine Beschreibung ein.",
  "documents.step2.title": "Kategorien zuweisen",
  "documents.step2.description": "Klassifizieren Sie Dokumente mit den 14 vordefinierten Kategorien.",
  "documents.step2.detail": "Jedes Dokument erhält eine Kategorie wie CE-Konformitätserklärung, Testbericht, Sicherheitsdatenblatt, Zertifikat, Produktdatenblatt, Bedienungsanleitung oder andere. Die Kategorie bestimmt, wie das Dokument in der DPP-Ansicht dargestellt wird und beeinflusst den AI-Compliance-Score. Wählen Sie die passendste Kategorie beim Upload oder ändern Sie sie nachträglich.",
  "documents.step3.title": "Dokumente mit Produkten verknüpfen",
  "documents.step3.description": "Weisen Sie hochgeladene Dokumente einem oder mehreren Produkten zu.",
  "documents.step3.detail": "Nach dem Upload können Sie Dokumente mit Produkten verknüpfen. Öffnen Sie dazu das Produkt und navigieren Sie zum Tab 'Dokumente', oder nutzen Sie die Verknüpfungsfunktion direkt in der Dokumentenübersicht. Ein Dokument kann mehreren Produkten zugeordnet werden — ideal für Zertifikate, die für eine ganze Produktlinie gelten.",
  "documents.step4.title": "Dokumenten-Tracker verwenden",
  "documents.step4.description": "Behalten Sie den Überblick über Ablaufdaten und fehlende Dokumente.",
  "documents.step4.detail": "Der Dokumenten-Tracker unter Dokumente → Tracker zeigt eine Übersicht aller Dokumente mit ihren Gültigkeitszeiträumen. Abgelaufene Dokumente werden rot markiert, bald ablaufende gelb. So können Sie rechtzeitig Verlängerungen einleiten. Der Tracker zeigt auch, welche Produkte noch fehlende Pflichtdokumente haben.",
  "documents.step5.title": "Dokumente anzeigen und herunterladen",
  "documents.step5.description": "Nutzen Sie den integrierten Viewer für eine schnelle Vorschau.",
  "documents.step5.detail": "Klicken Sie auf ein Dokument in der Liste, um eine Vorschau im integrierten Viewer zu öffnen. PDF-Dateien werden direkt im Browser angezeigt, Bilder in einer Lightbox. Von hier aus können Sie das Dokument herunterladen, die Details bearbeiten oder die Verknüpfung zu Produkten verwalten.",
  "documents.tip1": "Laden Sie Ihre CE-Konformitätserklärungen und Testberichte als Erstes hoch — sie haben den größten Einfluss auf den AI-Compliance-Score und sind für die ESPR-Verordnung besonders relevant.",
  "documents.link": "/documents",

  "supply-chain.title": "Lieferkette",
  "supply-chain.subtitle": "Lieferketten-Schritte, Lieferanten und Transportwege dokumentieren",
  "supply-chain.step1.title": "Lieferketten-Einträge erstellen",
  "supply-chain.step1.description": "Dokumentieren Sie jeden Schritt in Ihrer Lieferkette.",
  "supply-chain.step1.detail": "Unter Lieferkette → Neuer Eintrag können Sie einzelne Stationen Ihrer Lieferkette erfassen. Jeder Eintrag umfasst: Name der Station, Standort (Land, Stadt, Adresse), Prozesstyp, Transportmodus, Zeitraum und optionale Details wie CO₂-Emissionen und Kosten. Die Einträge werden in der Reihenfolge angezeigt und können per Drag-and-Drop umsortiert werden.",
  "supply-chain.step2.title": "Prozesstypen zuweisen",
  "supply-chain.step2.description": "Klassifizieren Sie jeden Schritt mit einem der 9 vordefinierten Prozesstypen.",
  "supply-chain.step2.detail": "Trackbliss unterstützt 9 Prozesstypen: Rohstoffgewinnung, Verarbeitung, Fertigung, Montage, Verpackung, Lagerung, Transport, Distribution und Einzelhandel. Jeder Typ hat ein eigenes Icon und eine Farbe für die visuelle Darstellung in der Lieferketten-Übersicht und im öffentlichen DPP.",
  "supply-chain.step3.title": "Transportmodi angeben",
  "supply-chain.step3.description": "Dokumentieren Sie die Transportart zwischen den Stationen.",
  "supply-chain.step3.detail": "Für jeden Lieferketten-Schritt können Sie den Transportmodus wählen: LKW, Schiff, Flugzeug, Bahn oder Pipeline. Der Transportmodus beeinflusst die CO₂-Bilanz und wird in der visuellen Lieferketten-Darstellung angezeigt. Sie können auch die geschätzte Transportstrecke in Kilometern und die damit verbundenen Emissionen erfassen.",
  "supply-chain.step4.title": "Lieferanten verwalten",
  "supply-chain.step4.description": "Pflegen Sie Ihre Lieferantenstammdaten und verknüpfen Sie diese mit Produkten.",
  "supply-chain.step4.detail": "Unter Lieferanten können Sie Ihre Lieferanten mit Kontaktdaten, Adressen, Zertifizierungen und internen Notizen anlegen. Verknüpfen Sie Lieferanten mit Produkten, um eine lückenlose Dokumentation der Beschaffungskette zu gewährleisten. Der Lieferantenstatus (aktiv, inaktiv, gesperrt) hilft bei der Verwaltung.",
  "supply-chain.step5.title": "Lieferantenportal nutzen",
  "supply-chain.step5.description": "Laden Sie Lieferanten zur Selbstregistrierung über ein sicheres Portal ein.",
  "supply-chain.step5.detail": "Über das Lieferantenportal können Sie Einladungs-Links an Lieferanten senden. Der Lieferant füllt einen 4-Schritte-Wizard aus: Unternehmensdaten, Adresse, Rechts-/Bankdaten und Geschäftsdetails. Nach der Registrierung erscheint der Lieferant mit Status 'Ausstehend' in Ihrer Liste, und Sie können ihn genehmigen oder ablehnen.",
  "supply-chain.step6.title": "GLN und Facility Identifier",
  "supply-chain.step6.description": "Verwenden Sie GS1 Global Location Numbers für die Standortidentifikation.",
  "supply-chain.step6.detail": "Jeder Lieferketten-Eintrag kann eine GLN (Global Location Number) oder einen alternativen Facility Identifier erhalten. Die GLN ist ein 13-stelliger GS1-Standard zur eindeutigen Identifikation von Standorten und wird zunehmend für die Lieferkettentransparenz nach EU-ESPR gefordert. Tragen Sie die GLN im Feld 'Standort-Identifier' ein.",
  "supply-chain.tip1": "Beginnen Sie mit einer groben Lieferkette (Rohstoff → Fertigung → Distribution) und verfeinern Sie diese schrittweise. Eine vollständige Lieferkette verbessert den Compliance-Score erheblich.",
  "supply-chain.link": "/supply-chain",

  "compliance.title": "Compliance & AI",
  "compliance.subtitle": "AI-gestützte Compliance-Prüfung und EU-Regulierungen verstehen",
  "compliance.step1.title": "Compliance-Übersicht nutzen",
  "compliance.step1.description": "Die Compliance-Seite zeigt den Gesamtstatus Ihrer Produkte.",
  "compliance.step1.detail": "Unter Compliance → Übersicht sehen Sie den aggregierten Compliance-Status aller Produkte: durchschnittlicher Score, Anzahl der Warnungen, fehlende Dokumente und Produkte mit kritischen Lücken. Die Übersicht hilft Ihnen, schnell zu erkennen, wo Handlungsbedarf besteht.",
  "compliance.step2.title": "Erste AI-Prüfung starten",
  "compliance.step2.description": "Starten Sie eine AI-gestützte Compliance-Analyse für ein Produkt.",
  "compliance.step2.detail": "Navigieren Sie zu einem Produkt und öffnen Sie den Tab 'AI-Compliance-Check'. Klicken Sie auf 'AI-Compliance-Check starten'. Die Analyse verwendet Claude Sonnet 4 über die OpenRouter API und bewertet Ihr Produkt in 3 Phasen: Score & Risikomatrix, Detaillierte Befunde und Aktionsplan. Jede Phase dauert ca. 15-30 Sekunden mit Live-Streaming-Anzeige.",
  "compliance.step3.title": "Compliance-Score verstehen",
  "compliance.step3.description": "Der Score von 0-100 zeigt den Grad der EU-ESPR-Konformität.",
  "compliance.step3.detail": "Die Bewertungsskala: 90-100 (alle wesentlichen Anforderungen erfüllt), 70-89 (überwiegend konform, einzelne Lücken), 50-69 (erhebliche Lücken, fehlende Zertifikate), 30-49 (schwerwiegende Mängel in mehreren Bereichen), 0-29 (grundlegende Compliance-Anforderungen nicht erfüllt). Der Score wird als animiertes Gauge-Diagramm mit Risikostufe (niedrig/mittel/hoch/kritisch) angezeigt.",
  "compliance.step4.title": "Befunde analysieren",
  "compliance.step4.description": "Prüfen Sie die kategorisierten Compliance-Befunde im Detail.",
  "compliance.step4.detail": "Die AI identifiziert 8-15 Befunde, kategorisiert nach 14 Regulierungsbereichen: ESPR, Batterie-VO, PPWR, GPSR, CE, REACH, RoHS, EMC, RED, LVD, Dokumente, DPP, Nationale Gesetze und Sonstige. Jeder Befund hat einen Schweregrad (kritisch, hoch, mittel, niedrig), Status und detaillierte Beschreibung mit konkreten Handlungsempfehlungen.",
  "compliance.step5.title": "Aktionsplan umsetzen",
  "compliance.step5.description": "Folgen Sie dem priorisierten Aktionsplan zur Verbesserung.",
  "compliance.step5.detail": "Der Aktionsplan ist nach Priorität geordnet: P1 (sofort handeln — kritische Compliance-Lücken), P2 (zeitnah — wichtige Verbesserungen) und P3 (mittelfristig — strategische Optimierungen). Jeder Aktionspunkt enthält eine Beschreibung, den geschätzten Aufwand und die betroffene Regulierung. Zusätzlich werden Quick Wins, Verbesserungen und strategische Empfehlungen aufgelistet.",
  "compliance.step6.title": "PDF-Report exportieren",
  "compliance.step6.description": "Erstellen Sie einen druckfertigen PDF-Report der Compliance-Analyse.",
  "compliance.step6.detail": "Nach Abschluss der Analyse können Sie einen mehrseitigen PDF-Report erstellen. Klicken Sie auf 'PDF exportieren', um einen Report mit Deckblatt, Executive Summary, Score-Gauge, vollständiger Risikomatrix, allen Befunden, dem Aktionsplan und den Empfehlungen zu generieren. Der Report wird clientseitig erzeugt und eignet sich hervorragend für Audits und Management-Präsentationen.",
  "compliance.step7.title": "Prüfhistorie einsehen",
  "compliance.step7.description": "Vergleichen Sie frühere Compliance-Prüfungen über die Zeit.",
  "compliance.step7.detail": "Unter dem Reiter 'Historie' im AI-Compliance-Check-Tab sehen Sie alle bisherigen Analysen für das Produkt. Jeder Eintrag zeigt Datum, Score, Risikostufe und eine Zusammenfassung. Sie können frühere Analysen öffnen, um die vollständigen Ergebnisse einzusehen, oder alte Einträge löschen. So verfolgen Sie den Compliance-Fortschritt über die Zeit.",
  "compliance.step8.title": "EU-Regulierungen nachschlagen",
  "compliance.step8.description": "Nutzen Sie die integrierte Regulierungsdatenbank als Nachschlagewerk.",
  "compliance.step8.detail": "Unter Regulierungen finden Sie eine umfassende Datenbank mit EU-Verordnungen (ESPR, Batterie-VO, PPWR, GPSR), nationalen Gesetzen (ElektroG, BattG, VerpackG, AGEC), Piktogramm-Übersichten und aktuellen Compliance-Nachrichten. Nutzen Sie die Länderspezifischen Checklisten, um die Anforderungen für Ihre Zielmärkte systematisch abzuarbeiten.",
  "compliance.tip1": "Füllen Sie möglichst viele Produktdaten, ESPR-Felder und Lieferketten-Informationen aus, bevor Sie die AI-Prüfung starten. Je vollständiger die Daten, desto genauer und hilfreicher ist die Analyse.",
  "compliance.tip2": "Jede AI-Compliance-Prüfung verbraucht 3 AI-Credits (eine pro Phase). Überlegen Sie strategisch, welche Produkte Sie zuerst prüfen lassen — beginnen Sie mit Ihren meistverkauften oder regulatorisch sensibelsten Produkten.",
  "compliance.link": "/compliance",

  "returns.title": "Returns Hub",
  "returns.subtitle": "Retouren, Tickets, E-Mail-Vorlagen und Workflows verwalten",
  "returns.step1.title": "Returns-Dashboard kennenlernen",
  "returns.step1.description": "Das Returns-Dashboard zeigt KPIs und Trends Ihres Retourenmanagements.",
  "returns.step1.detail": "Unter Returns → Dashboard sehen Sie die wichtigsten Kennzahlen: offene Retouren, heute eingegangene, durchschnittliche Bearbeitungszeit, Retourenquote und Erstattungsvolumen. Interaktive Diagramme zeigen die Entwicklung über die Zeit, Statusverteilung und Top-Retourengründe. Die KPI-Karten aktualisieren sich in Echtzeit.",
  "returns.step2.title": "Retouren verwalten",
  "returns.step2.description": "Bearbeiten Sie Retouren durch den 12-stufigen Statusprozess.",
  "returns.step2.detail": "Jede Retoure durchläuft bis zu 12 Status: Erstellt → Genehmigung ausstehend → Genehmigt → Versandlabel erstellt → Versendet → Zugestellt → Inspektion läuft → Erstattung in Bearbeitung → Erstattung abgeschlossen → Abgeschlossen (plus Abgelehnt und Storniert). In der Retourendetailansicht können Sie den Status ändern, Artikel inspizieren, Fotos prüfen, die Timeline einsehen und Notizen hinzufügen.",
  "returns.step3.title": "Kunden verwalten",
  "returns.step3.description": "Pflegen Sie Kundenprofile mit Retouren-Historie und Risikobewertung.",
  "returns.step3.detail": "Unter Returns → Kunden finden Sie das Kundenverzeichnis mit Profilen, Adressen, Zahlungsmethoden und detaillierten Retourenstatistiken. Der Risiko-Score (0-100) hilft, Kunden mit auffälligem Retourenverhalten zu identifizieren. Tags ermöglichen eine flexible Kategorisierung. Die Kundendetailseite zeigt die komplette Retouren- und Ticket-Historie.",
  "returns.step4.title": "Tickets bearbeiten",
  "returns.step4.description": "Nutzen Sie das Ticket-System für Kundenanfragen und Support.",
  "returns.step4.detail": "Tickets können per E-Mail, Kundenportal oder manuell erstellt werden. Die Ticket-Ansicht bietet eine Listenansicht und ein Kanban-Board nach Status (Offen, In Bearbeitung, Wartend, Gelöst, Geschlossen). Jedes Ticket hat eine Nachrichtenhistorie, SLA-Tracking mit Countdown, Zuweisung an Bearbeiter, Tags und Prioritätsstufen. Nutzen Sie Schnellantwort-Vorlagen für häufige Anfragen.",
  "returns.step5.title": "E-Mail-Vorlagen gestalten",
  "returns.step5.description": "Erstellen Sie professionelle E-Mail-Vorlagen mit dem visuellen Editor.",
  "returns.step5.detail": "Unter Returns → E-Mail-Vorlagen finden Sie 15 vorgefertigte Vorlagen für alle Retouren- und Ticket-Ereignisse. Der visuelle Editor funktioniert wie ein E-Mail-Builder: Fügen Sie Blöcke hinzu (Text, Button, Bild, Info-Box, Spalten, Trennlinie, Hero), passen Sie Design und Farben an und bearbeiten Sie Texte mit Variablen-Platzhaltern wie {{customerName}} und {{returnNumber}}. Alle Vorlagen sind zweisprachig (DE/EN).",
  "returns.step6.title": "Workflows automatisieren",
  "returns.step6.description": "Erstellen Sie Automatisierungsregeln mit dem visuellen Workflow-Builder.",
  "returns.step6.detail": "Unter Returns → Workflows können Sie Automatisierungsregeln erstellen. Der visuelle Builder verwendet ein Knoten-Graph-System: Trigger-Knoten (z.B. 'Retoure erstellt'), Bedingungs-Knoten (z.B. 'Wenn Wert > 100€'), Aktions-Knoten (z.B. 'Status setzen', 'E-Mail senden', 'Ticket erstellen') und Verzögerungs-Knoten. 21 verschiedene Aktionstypen stehen zur Verfügung.",
  "returns.step7.title": "Berichte analysieren",
  "returns.step7.description": "Nutzen Sie die Berichtsseite für tiefgehende Analysen.",
  "returns.step7.detail": "Unter Returns → Berichte finden Sie detaillierte Analysen: Retourenvolumen über Zeit, Retourenquote nach Produktkategorie, durchschnittliche Bearbeitungszeit, Erstattungsvolumen, Top-Retourengründe, Kundensegment-Analyse und SLA-Einhaltungsrate. Filter ermöglichen die Eingrenzung nach Zeitraum, Status, Grund und Produkt.",
  "returns.step8.title": "Einstellungen konfigurieren",
  "returns.step8.description": "Passen Sie den Returns Hub in 7 Einstellungsbereichen an.",
  "returns.step8.detail": "Die Returns-Einstellungen umfassen 7 Tabs: Allgemein (Aktivierung, Nummernpräfix, Standard-Lösung), Retourengründe (Kategorien mit Untergründen und Folgefragen), Lizenz (Tarifmanagement), Branding (Farben, Logo, Portal-URLs), Tickets/SLA (Reaktionszeiten, Schnellantworten), Benachrichtigungen (E-Mail-Aktivierung, Absendername, Sprache) und Kundenportal (Funktionen, Registrierung, Sicherheit).",
  "returns.tip1": "Konfigurieren Sie Ihre Retourengründe mit Unterkategorien und Folgefragen, um strukturierte Daten zu sammeln, die bei der Ursachenanalyse helfen. Zum Beispiel: Hauptgrund 'Defekt' → Untergrund 'Anzeige defekt' → Folgefrage 'Wann ist der Defekt aufgetreten?'.",
  "returns.tip2": "Erstellen Sie Workflow-Regeln für häufige Szenarien: z.B. automatische Genehmigung bei Retourenwert unter 50€, automatische Ticket-Erstellung bei hohem Risiko-Score, oder automatische E-Mail-Benachrichtigung bei Statusänderung.",
  "returns.link": "/returns",

  "portals.title": "Portale",
  "portals.subtitle": "Kunden- und Lieferantenportale für Self-Service und Zusammenarbeit",
  "portals.step1.title": "Kundenportal verstehen",
  "portals.step1.description": "Das Kundenportal bietet Ihren Kunden Self-Service für Retouren und Support.",
  "portals.step1.detail": "Das Kundenportal ist über /customer/{tenantSlug} erreichbar und bietet Kunden eine eigene Oberfläche mit Dashboard, Retourenliste, neue Retoure erstellen, Ticket-System und Profilverwaltung. Kunden können sich selbst registrieren oder werden eingeladen. Die Authentifizierung ist separat vom Admin-Login (eigene Auth-Tabelle rh_customer_profiles).",
  "portals.step2.title": "Kundenregistrierung einrichten",
  "portals.step2.description": "Konfigurieren Sie, wie sich Kunden am Portal anmelden können.",
  "portals.step2.detail": "In den Returns-Einstellungen unter 'Kundenportal' können Sie festlegen: Selbstregistrierung erlauben (ja/nein), E-Mail-Verifizierung erforderlich, Magic-Link-Login aktivieren. Zusätzlich können Sie Feature-Toggles setzen: Retouren erstellen, Tickets anzeigen/erstellen, Profil bearbeiten, Bestellhistorie anzeigen und Versandlabels herunterladen.",
  "portals.step3.title": "Retourenregistrierungs-Wizard",
  "portals.step3.description": "Kunden können über einen 7-Schritte-Wizard selbst Retouren anmelden.",
  "portals.step3.detail": "Der öffentliche Retourenregistrierungs-Wizard unter /returns/register/{tenantSlug} führt Kunden durch 7 Schritte: 1) Identifikation (Bestellnummer + E-Mail), 2) Artikel auswählen, 3) Retourengrund wählen, 4) Fotos hochladen, 5) Gewünschte Lösung wählen (Erstattung/Umtausch/Gutschein/Reparatur), 6) Versand & Adresse, 7) Bestätigung & Absenden.",
  "portals.step4.title": "Kunden-Tickets nutzen",
  "portals.step4.description": "Kunden können über das Portal Support-Tickets erstellen und verfolgen.",
  "portals.step4.detail": "Im Kundenportal können Kunden neue Tickets erstellen, bestehende Tickets einsehen und Nachrichten senden. Interne Notizen der Agenten sind für Kunden nicht sichtbar (isInternal-Flag). Die Ticket-Ansicht zeigt den aktuellen Status, die Nachrichtenhistorie und eventuelle Anhänge. Kunden werden per E-Mail über Antworten benachrichtigt.",
  "portals.step5.title": "Lieferantenportal-Flow",
  "portals.step5.description": "Laden Sie Lieferanten zur Selbstregistrierung über ein sicheres Portal ein.",
  "portals.step5.detail": "Der Lieferantenportal-Flow: 1) Sie erstellen unter Lieferanten eine Einladung mit E-Mail-Adresse, 2) ein eindeutiger Einladungs-Link wird generiert (gültig 14 Tage), 3) Sie teilen den Link mit dem Lieferanten, 4) der Lieferant füllt den 4-Schritte-Wizard aus (Unternehmen, Adresse, Rechts-/Bankdaten, Geschäftsdetails), 5) die Registrierung wird als 'ausstehend' markiert.",
  "portals.step6.title": "Lieferantenfreigabe verwalten",
  "portals.step6.description": "Prüfen und genehmigen oder lehnen Sie Lieferantenregistrierungen ab.",
  "portals.step6.detail": "Neue Lieferantenregistrierungen erscheinen in der Lieferantenliste mit dem Status 'Genehmigung ausstehend'. Klicken Sie auf 'Genehmigen', um den Lieferanten zu aktivieren (Status: aktiv, verifiziert: ja), oder auf 'Ablehnen' mit optionaler Begründung (Status: gesperrt). Genehmigte Lieferanten können dann Produkten zugeordnet werden.",
  "portals.tip1": "Passen Sie das Kundenportal-Branding an Ihre Marke an: Primärfarbe, Logo, Willkommensnachricht und Footer-Text können unabhängig vom Admin-Branding konfiguriert werden.",
  "portals.link": "/returns/settings",

  "settings.title": "Einstellungen",
  "settings.subtitle": "Unternehmensdaten, Branding, Benutzer und Domänen konfigurieren",
  "settings.step1.title": "Unternehmensdaten pflegen",
  "settings.step1.description": "Hinterlegen Sie Ihre Firmendaten als Mandanten-Stammdaten.",
  "settings.step1.detail": "Unter Einstellungen → Unternehmen pflegen Sie den Firmennamen, Slug (URL-Kennung für Portale), Logo und allgemeine Einstellungen. Der Slug wird in Portal-URLs verwendet (z.B. /customer/{slug}) und sollte kurz und aussagekräftig sein. Änderungen am Slug beeinflussen alle Portal-Links.",
  "settings.step2.title": "Branding einrichten",
  "settings.step2.description": "Passen Sie Farben, Logo, Favicon und Dokumenttitel an.",
  "settings.step2.detail": "Unter Einstellungen → Branding konfigurieren Sie die visuelle Identität: Primärfarbe (wird als CSS-Variable --primary gesetzt), Logo-Upload (für Header und Portale), Favicon-Upload (Browser-Tab-Icon) und Dokumenttitel (Browser-Tab-Text). Die Branding-Einstellungen werden beim Login geladen und als Runtime-Theme angewendet. Alle Portale erben diese Einstellungen.",
  "settings.step3.title": "Benutzer verwalten",
  "settings.step3.description": "Laden Sie Teammitglieder ein und verwalten Sie Rollen.",
  "settings.step3.detail": "Unter Einstellungen → Benutzer sehen Sie alle Teammitglieder Ihres Mandanten. Klicken Sie auf 'Benutzer einladen', um eine Einladung per E-Mail zu senden. Eingeladene Benutzer erhalten einen Magic Link zum Erstlogin. Sie können Benutzerrollen zuweisen und Einladungen verwalten (erneut senden, stornieren, löschen). Die Benutzeranzahl ist durch Ihren Tarif begrenzt.",
  "settings.step4.title": "Custom Domain einrichten",
  "settings.step4.description": "Nutzen Sie Ihre eigene Domain für die Portale (White-Label).",
  "settings.step4.detail": "Unter Returns → Einstellungen → Portal-Domain können Sie eine eigene Domain konfigurieren (z.B. returns.ihrefirma.de). Der 4-Schritte-Wizard führt Sie durch: 1) Domain eingeben, 2) DNS-Provider wählen (Cloudflare, GoDaddy, Namecheap, Hetzner, IONOS, Strato, AWS Route 53), 3) CNAME-Eintrag anlegen, 4) DNS-Verifizierung. Nach erfolgreicher Verifizierung werden Ihre Portale unter der eigenen Domain erreichbar — ohne Mandanten-Slug in der URL.",
  "settings.step5.title": "White-Label-Portale verstehen",
  "settings.step5.description": "Nach der Domain-Einrichtung arbeiten die Portale im White-Label-Modus.",
  "settings.step5.detail": "Sobald eine Custom Domain verifiziert ist, erkennt die CustomDomainGate-Komponente den Hostnamen und schaltet in den Slug-freien Modus: / (Retourenportal-Startseite), /register (Retourenregistrierung), /track (Sendungsverfolgung), /portal (Kundenportal). Ihr Branding (Logo, Farben, Name) wird automatisch geladen. Kunden sehen ausschließlich Ihre Marke — keine Trackbliss-Hinweise.",
  "settings.step6.title": "API-Keys verwalten",
  "settings.step6.description": "Erstellen und verwalten Sie API-Schlüssel für Integrationen.",
  "settings.step6.detail": "Unter Einstellungen → API-Keys können Sie Schlüssel für die programmatische Anbindung verwalten. API-Keys ermöglichen den Zugriff auf Ihre Daten über die Supabase API. Behandeln Sie API-Keys vertraulich und rotieren Sie sie regelmäßig. Abgelaufene oder kompromittierte Keys können jederzeit widerrufen werden.",
  "settings.tip1": "Richten Sie zuerst das Branding (Logo und Primärfarbe) ein — diese Einstellungen werden in allen Portalen, E-Mail-Vorlagen und der DPP-Ansicht verwendet und schaffen ein einheitliches Markenerlebnis.",
  "settings.link": "/settings/company",

  "billing.title": "Abrechnung",
  "billing.subtitle": "Tarife, Module, AI-Credits und Rechnungen verwalten",
  "billing.step1.title": "Tarife vergleichen",
  "billing.step1.description": "Wählen Sie zwischen Free, Pro und Enterprise — mit monatlicher oder jährlicher Abrechnung.",
  "billing.step1.detail": "Trackbliss bietet 3 Tarife: Free (5 Produkte, 3 Chargen/Produkt, 1 Benutzer, 3 AI-Credits/Monat), Pro (€49/Monat: 50 Produkte, 20 Chargen, 5 Benutzer, 25 Credits, alle 11 Templates) und Enterprise (€149/Monat: unbegrenzte Produkte/Chargen, 25 Benutzer, 100 Credits, Custom CSS). Jährliche Zahlung spart 20%. Navigieren Sie zu Einstellungen → Abrechnung, um die Tarife zu vergleichen.",
  "billing.step2.title": "Zusatzmodule aktivieren",
  "billing.step2.description": "Erweitern Sie Trackbliss mit spezialisierten Modulen.",
  "billing.step2.detail": "6 Zusatzmodule stehen zur Verfügung: Returns Hub Starter (€29/Mo), Returns Hub Professional (€69/Mo), Returns Hub Business (€149/Mo, Enterprise erforderlich), Lieferantenportal (€19/Mo), Kundenportal (€29/Mo, erfordert Returns Hub) und Custom Domain/White-Label (€19/Mo). Module können nur aktiviert werden, wenn der Basistarif die Voraussetzung erfüllt (Pro oder höher).",
  "billing.step3.title": "AI-Credits verstehen",
  "billing.step3.description": "AI-Credits werden für alle KI-gestützten Analysen benötigt.",
  "billing.step3.detail": "Jeder Tarif enthält monatliche Credits (Free: 3, Pro: 25, Enterprise: 100), die am Ende des Abrechnungszeitraums verfallen. Credit-Verbrauch: AI-Compliance-Check = 3 Credits (eine pro Phase), Gesamtbewertung = 1, Aktionsplan = 1, Zusätzliche Anforderungen = 1, Chat-Nachricht = 1. Zusätzliche Credit-Pakete (50/€9, 200/€29, 500/€59) verfallen nie und werden erst verbraucht, wenn die monatlichen Credits aufgebraucht sind.",
  "billing.step4.title": "Abonnement verwalten",
  "billing.step4.description": "Ändern Sie Ihren Tarif oder verwalten Sie Zahlungsmethoden über Stripe.",
  "billing.step4.detail": "Auf der Abrechnungsseite können Sie Ihren Tarif upgraden oder downgraden. Upgrades werden sofort wirksam, Downgrades am Ende der aktuellen Laufzeit. Über 'Abonnement verwalten' gelangen Sie zum Stripe-Kundenportal, wo Sie Zahlungsmethoden ändern, Rechnungen einsehen und Kündigungen vornehmen können. Bei einem Downgrade bleiben alle Daten erhalten — nur neue Erstellungen werden durch die niedrigeren Limits blockiert.",
  "billing.step5.title": "Kontingente und Limits beachten",
  "billing.step5.description": "Kontingente werden in Echtzeit geprüft und durchgesetzt.",
  "billing.step5.detail": "Beim Erreichen eines Limits (z.B. maximale Produktanzahl) wird die entsprechende Aktion blockiert und ein Upgrade-Hinweis angezeigt mit aktuellem Verbrauch und Limit. Überwachen Sie Ihren Verbrauch auf der Abrechnungsseite: Fortschrittsbalken zeigen die Auslastung an (gelb ab 80%, rot ab 100%). Betroffene Ressourcen: Produkte, Chargen/Produkt, Benutzer, Dokumente, Speicherplatz und AI-Credits.",
  "billing.tip1": "Starten Sie mit dem Free-Tarif, um Trackbliss kennenzulernen. Sie können jederzeit auf Pro oder Enterprise upgraden, wenn Sie mehr Kapazität oder Zusatzmodule benötigen — ein Downgrade ist ebenso jederzeit möglich.",
  "billing.link": "/settings/billing"
}