{
  "title": "Training Guide",
  "subtitle": "Learn how to use Trackbliss step by step — from creating your first Digital Product Passport to managing returns and ensuring EU compliance.",
  "progress": "Your Progress",
  "completed": "Completed",
  "of": "of",
  "chapters": "Chapters",
  "markComplete": "Mark as completed",
  "goToPage": "Go to page",
  "expandAll": "Expand all",
  "collapseAll": "Collapse all",
  "tip": "Tip",
  "shortcut": "Shortcut",
  "important": "Important",
  "note": "Note",
  "allComplete": "Congratulations! You've completed the entire guide.",
  "nextChapter": "Next chapter",
  "previousChapter": "Previous chapter",
  "resetProgress": "Reset progress",
  "resetConfirm": "Are you sure you want to reset all progress? This cannot be undone.",
  "searchPlaceholder": "Search chapters and steps...",
  "gettingStarted": "Getting Started",
  "estimatedTime": "Estimated time",
  "minutes": "minutes",
  "prerequisite": "Prerequisite",
  "stepOf": "Step {{current}} of {{total}}",
  "notStarted": "Not started",
  "inProgress": "In progress",
  "startLearning": "Start learning",
  "resumeLearning": "Resume learning",
  "overview": "Overview",
  "jumpToChapter": "Jump to chapter",
  "backToOverview": "Back to overview",

  "dashboard.title": "Dashboard",
  "dashboard.subtitle": "Your command center for Digital Product Passports",
  "dashboard.step1.title": "Understanding KPIs",
  "dashboard.step1.description": "The dashboard displays key performance indicators that give you an instant overview of your DPP operations.",
  "dashboard.step1.detail": "You'll see total product count, active batches, overall compliance score, document count, and supply chain entries. Each KPI card is clickable and navigates to its respective detail page.",
  "dashboard.step2.title": "Navigating with the Sidebar",
  "dashboard.step2.description": "The left sidebar provides quick access to every section of Trackbliss.",
  "dashboard.step2.detail": "The sidebar is organized into sections: Products, DPP, Documents, Supply Chain, Compliance, Returns Hub, and Settings. Click any item to navigate directly. The sidebar collapses on mobile devices and can be toggled with the hamburger menu.",
  "dashboard.step3.title": "Using Quick Actions",
  "dashboard.step3.description": "The dashboard offers quick action buttons to perform common tasks without navigating away.",
  "dashboard.step3.detail": "Use 'New Product' to create a product, 'Upload Document' to add certificates, or 'Generate QR' to create QR codes. These shortcuts save time for daily operations.",
  "dashboard.step4.title": "Reading Charts and Trends",
  "dashboard.step4.description": "Interactive charts show trends over time for products, compliance scores, and return rates.",
  "dashboard.step4.detail": "Hover over chart data points to see exact values. Charts update in real-time as you add products and complete compliance checks. Use the time range selector to view weekly, monthly, or yearly trends.",
  "dashboard.step5.title": "Switching Language",
  "dashboard.step5.description": "Trackbliss supports both English and German interfaces.",
  "dashboard.step5.detail": "Click the language toggle in the top navigation bar to switch between English (EN) and German (DE). Your preference is saved automatically and persists across sessions.",
  "dashboard.tip1": "Press Ctrl+K (or Cmd+K on Mac) to open the command palette for lightning-fast navigation to any page or action.",
  "dashboard.shortcut1": "Ctrl+K / Cmd+K opens the command palette from anywhere in the app.",
  "dashboard.estimatedTime": "5",
  "dashboard.link": "/",

  "products.title": "Products",
  "products.subtitle": "Create and manage your product catalog with full EU compliance data",
  "products.step1.title": "Creating a New Product",
  "products.step1.description": "Start by adding your first product to the system with its basic information.",
  "products.step1.detail": "Navigate to Products and click 'New Product'. Fill in the product name, GTIN (Global Trade Item Number), category, and description. The GTIN is essential for generating GS1 Digital Link URLs for your DPP.",
  "products.step2.title": "Managing Categories",
  "products.step2.description": "Organize products using categories that align with EU product classification.",
  "products.step2.detail": "Go to Products > Categories to create and manage product categories. Categories help organize your catalog and are used by the AI compliance check to apply the correct EU regulations to each product type.",
  "products.step3.title": "Working with Product Tabs",
  "products.step3.description": "Each product has multiple tabs for comprehensive data entry.",
  "products.step3.detail": "The product form includes tabs for General info, Materials & Composition, Sustainability (carbon footprint), Certifications, Customs Data, Support Resources, and ESPR Compliance. Complete each tab thoroughly for the best compliance scores.",
  "products.step4.title": "Creating Batches and Serial Numbers",
  "products.step4.description": "Batches represent production runs with unique serial numbers for individual DPPs.",
  "products.step4.detail": "Open a product and click 'New Batch'. Enter the batch number, production date, and serial numbers. Each serial number generates a unique DPP URL. You can add serial numbers individually or in bulk.",
  "products.step5.title": "ESPR Compliance Fields",
  "products.step5.description": "Fill in the 21 mandatory ESPR 2024/1781 fields for full EU compliance.",
  "products.step5.detail": "The ESPR tab contains six sections: Economic Operators (manufacturer, importer, distributor), SVHC Declaration, Durability & Repairability metrics, Conformity Assessment, Safety Information, and Product Registry numbers (EPREL, SCIP).",
  "products.step6.title": "Uploading Product Images",
  "products.step6.description": "Add product photos that will appear on the public DPP page.",
  "products.step6.detail": "In the product detail view, use the image gallery to upload photos. You can reorder images by dragging, set a primary image, and add captions. The primary image appears as the hero image on the public DPP page.",
  "products.step7.title": "Linking Documents",
  "products.step7.description": "Attach certificates, test reports, and declarations to your products.",
  "products.step7.detail": "From the product detail page, navigate to the Documents section to link existing documents or upload new ones. Linked documents appear on the public DPP page and are evaluated during AI compliance checks.",
  "products.tip1": "Complete the Materials & Composition tab thoroughly — the AI compliance check heavily weighs material transparency when calculating your compliance score.",
  "products.tip2": "Use the 'Duplicate Batch' feature to quickly create new batches with similar settings, then just update the serial numbers.",
  "products.important1": "Every product needs a valid GTIN to generate GS1 Digital Link URLs. Without a GTIN, QR codes and public DPP links cannot be created.",
  "products.estimatedTime": "15",
  "products.link": "/products",

  "dpp.title": "Digital Product Passport",
  "dpp.subtitle": "Design, customize, and publish your Digital Product Passports",
  "dpp.step1.title": "DPP Overview Page",
  "dpp.step1.description": "The DPP overview shows all your products with their passport status.",
  "dpp.step1.detail": "Navigate to DPP to see a grid of all products with their DPP readiness status. Products with complete data show a green checkmark. Click any product to preview its public DPP page.",
  "dpp.step2.title": "Choosing a Template",
  "dpp.step2.description": "Select from 11 professionally designed templates for your DPP pages.",
  "dpp.step2.detail": "Go to Settings > Branding to choose your DPP template. Options include Modern, Classic, Compact, Minimal, Technical, Eco-Friendly, Premium, Government, Retail, Scientific, and Accessible. Each template is optimized for different industries and audiences.",
  "dpp.step3.title": "Customizing the Design",
  "dpp.step3.description": "Fine-tune colors, typography, hero section, and card styles for your DPP pages.",
  "dpp.step3.detail": "In the DPP Design settings, customize primary/secondary/accent colors, choose from 6 theme presets (Ocean, Forest, Sunset, Midnight, Corporate, Minimal), adjust typography (5 font families), configure hero style (gradient/solid/image/minimal), and set card border radius and shadow depth.",
  "dpp.step4.title": "QR Code Generator",
  "dpp.step4.description": "Generate QR codes that link directly to your Digital Product Passports.",
  "dpp.step4.detail": "Navigate to DPP > QR Generator. Select a product and batch, then customize the QR code with your brand colors, add a logo overlay, and choose the output format (PNG/SVG). QR codes follow the GS1 Digital Link standard for maximum interoperability.",
  "dpp.step5.title": "Visibility Settings",
  "dpp.step5.description": "Control which fields are visible to consumers, customs officers, and internal staff.",
  "dpp.step5.detail": "Go to DPP > Visibility to configure the 3-tier visibility system. 36 fields across 9 categories can be set to Consumer (public), Customs (restricted), or Internal (admin only). Set defaults at the tenant level or override per product.",
  "dpp.step6.title": "Understanding DPP URLs",
  "dpp.step6.description": "Each product serial has two URL formats for accessing its DPP page.",
  "dpp.step6.detail": "The local format is /p/{gtin}/{serial} and the GS1 Digital Link format is /01/{gtin}/21/{serial}. Both resolve to the same public DPP page. The GS1 format is the international standard used by customs authorities and supply chain partners.",
  "dpp.step7.title": "Customs View",
  "dpp.step7.description": "A specialized view showing customs-relevant data for border inspections.",
  "dpp.step7.detail": "Appending /customs to any DPP URL shows the customs view, which includes HS codes, country of origin, net/gross weight, manufacturer EORI, and VAT numbers. Fields marked as 'customs' or 'consumer' visibility level are displayed.",
  "dpp.tip1": "Use the Eco-Friendly template if sustainability is your key differentiator — it prominently features carbon footprint data and recycling information.",
  "dpp.tip2": "Set up tenant-wide visibility defaults first, then override only the specific products that need different settings.",
  "dpp.important1": "The GS1 Digital Link format (/01/{gtin}/21/{serial}) is the internationally recognized standard. Use this format when printing QR codes on physical products or packaging.",
  "dpp.note1": "DPP design changes apply to all products using the tenant-wide settings. Individual product overrides for visibility are separate from design settings.",
  "dpp.estimatedTime": "15",
  "dpp.link": "/dpp",

  "documents.title": "Documents",
  "documents.subtitle": "Upload, organize, and track certificates and compliance documents",
  "documents.step1.title": "Uploading Documents",
  "documents.step1.description": "Upload certificates, test reports, declarations of conformity, and other compliance documents.",
  "documents.step1.detail": "Navigate to Documents and click 'Upload'. Drag and drop files or click to browse. Supported formats include PDF, images, and common document types. Maximum file size is 50 MB. Enter a descriptive name, select the document category, and optionally set an expiry date.",
  "documents.step2.title": "Document Categories",
  "documents.step2.description": "Classify documents using 14 predefined categories for proper organization.",
  "documents.step2.detail": "Categories include Certificate of Conformity, Test Report, Safety Data Sheet, Declaration of Conformity, Material Composition, Environmental Certificate, Quality Certificate, User Manual, Technical Documentation, Regulatory Approval, Warranty Document, Supply Chain Document, Customs Document, and Other.",
  "documents.step3.title": "Linking Documents to Products",
  "documents.step3.description": "Associate uploaded documents with specific products for compliance tracking.",
  "documents.step3.detail": "When uploading or editing a document, use the product selector to link it to one or more products. Linked documents appear in the product's document tab and on the public DPP page. The AI compliance check evaluates all linked documents.",
  "documents.step4.title": "Document Tracking",
  "documents.step4.description": "Monitor document expiry dates and renewal requirements.",
  "documents.step4.detail": "The Document Tracker tab shows all documents with upcoming expiry dates. Documents expiring within 30 days are highlighted in amber, and expired documents in red. Use this view to proactively renew certificates before they lapse.",
  "documents.step5.title": "Document Viewer",
  "documents.step5.description": "Preview documents directly within Trackbliss without downloading.",
  "documents.step5.detail": "Click any document to open the built-in viewer. PDF documents render inline with zoom and page navigation controls. You can download the original file or copy a direct link for sharing with team members.",
  "documents.tip1": "Upload your Declaration of Conformity and CE certificates first — these have the highest impact on AI compliance check scores.",
  "documents.important1": "Documents with expiry dates will trigger warnings in the tracker 30 days before expiration. Set expiry dates on all time-limited certificates.",
  "documents.estimatedTime": "10",
  "documents.link": "/documents",

  "supply-chain.title": "Supply Chain",
  "supply-chain.subtitle": "Map and document your product supply chains for full transparency",
  "supply-chain.step1.title": "Adding Supply Chain Entries",
  "supply-chain.step1.description": "Document each step in your product's supply chain from raw materials to final delivery.",
  "supply-chain.step1.detail": "Navigate to Supply Chain and click 'Add Entry'. For each entry, specify the company name, location (country), process type, and position in the chain. Entries can be reordered by dragging to reflect the actual supply chain sequence.",
  "supply-chain.step2.title": "Process Types",
  "supply-chain.step2.description": "Classify each supply chain step with one of 9 standardized process types.",
  "supply-chain.step2.detail": "Available process types include Raw Material Extraction, Processing, Manufacturing, Assembly, Quality Control, Packaging, Warehousing, Distribution, and Retail. Each type has a distinct icon and color for easy visualization on the DPP page.",
  "supply-chain.step3.title": "Transport Modes and Emissions",
  "supply-chain.step3.description": "Record transport methods and their associated carbon emissions between supply chain steps.",
  "supply-chain.step3.detail": "For each entry, specify the transport mode (Road, Rail, Sea, Air, or Pipeline) and estimated CO2 emissions in kg. This data feeds into the product's overall carbon footprint calculation displayed on the DPP.",
  "supply-chain.step4.title": "Managing Suppliers",
  "supply-chain.step4.description": "Maintain a supplier directory and link suppliers to products and supply chain entries.",
  "supply-chain.step4.detail": "Go to Suppliers to manage your supplier database. Add supplier details including company name, contact information, certifications, and status. Link suppliers to specific products to track which suppliers contribute to which products.",
  "supply-chain.step5.title": "Supplier Portal Invitations",
  "supply-chain.step5.description": "Invite suppliers to self-register through a secure onboarding wizard.",
  "supply-chain.step5.detail": "On the Suppliers page, click 'Invite Supplier' and enter their email address. They receive a link to a 4-step registration wizard (Company Basics, Address, Legal & Banking, Business Details). After submission, you review and approve or reject the registration.",
  "supply-chain.step6.title": "GLN and Facility Identifiers",
  "supply-chain.step6.description": "Add Global Location Numbers (GLN) and facility identifiers for supply chain traceability.",
  "supply-chain.step6.detail": "Each supply chain entry supports a facility_identifier field for GLN or other location codes. These identifiers enable automated supply chain verification and are required by some EU regulations for full traceability.",
  "supply-chain.tip1": "Complete supply chain entries with transport modes and emissions data — this significantly improves your carbon footprint transparency score in AI compliance checks.",
  "supply-chain.note1": "Supply chain entries are product-specific. Each product has its own independent supply chain that can be configured with different steps and suppliers.",
  "supply-chain.estimatedTime": "12",
  "supply-chain.link": "/supply-chain",

  "compliance.title": "Compliance & AI Analysis",
  "compliance.subtitle": "Leverage AI-powered analysis to ensure full EU regulatory compliance",
  "compliance.step1.title": "Compliance Overview",
  "compliance.step1.description": "The compliance page shows your overall compliance status across all products.",
  "compliance.step1.detail": "Navigate to Compliance to see aggregated compliance scores, warnings for products with gaps, and a summary of required actions. The overview helps you prioritize which products need attention first.",
  "compliance.step2.title": "Running Your First AI Check",
  "compliance.step2.description": "Start an AI-powered compliance analysis on any product to identify gaps.",
  "compliance.step2.detail": "Open a product, go to the AI Compliance tab, and click 'Start AI Compliance Check'. The system uses Claude Sonnet 4 to analyze your product data in three phases. Each check consumes 3 AI credits. Ensure your product has materials, certifications, and supply chain data filled in for the best results.",
  "compliance.step3.title": "Understanding the Score",
  "compliance.step3.description": "The compliance score ranges from 0 to 100 with four risk levels.",
  "compliance.step3.detail": "90-100: All essential requirements met. 70-89: Mostly compliant with minor gaps. 50-69: Significant gaps requiring attention. 30-49: Serious deficiencies. 0-29: Basic requirements not met. The animated gauge shows your score with a color-coded risk badge (Low, Medium, High, Critical).",
  "compliance.step4.title": "Reviewing Findings",
  "compliance.step4.description": "Each analysis produces 8-15 categorized findings with severity and action recommendations.",
  "compliance.step4.detail": "Findings are grouped by regulation (ESPR, Battery, PPWR, GPSR, CE, REACH, RoHS, and more). Each finding shows its severity (info, warning, critical), current status, and a detailed description with recommended remediation steps. Click any finding to expand its full details.",
  "compliance.step5.title": "Action Plan and Priorities",
  "compliance.step5.description": "The AI generates a prioritized action plan with P1 (urgent), P2 (important), and P3 (nice-to-have) items.",
  "compliance.step5.detail": "Phase 3 of the analysis produces a timeline of action items sorted by priority. P1 items should be addressed immediately, P2 within weeks, and P3 as part of continuous improvement. Each item includes estimated effort and responsible department suggestions.",
  "compliance.step6.title": "Exporting PDF Reports",
  "compliance.step6.description": "Generate professional multi-page PDF compliance reports for auditors and stakeholders.",
  "compliance.step6.detail": "After an analysis completes, click 'Export PDF' to generate a comprehensive report. The PDF includes the score gauge, executive summary, risk matrix, all findings, action plan, and recommendations — formatted for print or digital sharing.",
  "compliance.step7.title": "Compliance Check History",
  "compliance.step7.description": "Track compliance progress over time by reviewing previous analysis results.",
  "compliance.step7.detail": "Each saved analysis appears in the History section with its date, score, and risk level. Compare current results with previous checks to verify that remediation actions improved your compliance score. You can view or delete any past analysis.",
  "compliance.step8.title": "EU Regulations Reference",
  "compliance.step8.description": "Browse the built-in regulations database covering EU and national product laws.",
  "compliance.step8.detail": "Navigate to Regulations to explore EU regulations (ESPR, Battery Regulation, PPWR, GPSR), national laws (ElektroG, BattG, VerpackG, AGEC), country-specific checklists, CE marking directives, and pictogram requirements. Use this as a reference while completing product data.",
  "compliance.tip1": "Run an AI compliance check after each major product data update to track your score improvement over time.",
  "compliance.tip2": "Use the AI chat panel (accessible from the compliance tab) to ask follow-up questions about specific findings or regulations.",
  "compliance.important1": "Each AI compliance check consumes 3 credits (one per phase). Make sure your product data is as complete as possible before running a check to get the most value from your credits.",
  "compliance.note1": "The AI analysis covers 14+ EU regulations including ESPR, Battery Regulation, PPWR, GPSR, CE Directives, REACH, and national laws. Results are saved automatically and can be compared over time.",
  "compliance.estimatedTime": "20",
  "compliance.link": "/compliance",

  "returns.title": "Returns Hub",
  "returns.subtitle": "Manage returns, tickets, and customer communications in one place",
  "returns.step1.title": "Returns Dashboard",
  "returns.step1.description": "The Returns Hub dashboard shows real-time KPIs and charts for your return operations.",
  "returns.step1.detail": "Navigate to Returns to see open returns, today's received returns, average processing days, return rate, and more. Interactive charts show return trends, top return reasons, and processing time distribution. Use the date range selector to filter the view.",
  "returns.step2.title": "Processing Returns",
  "returns.step2.description": "Manage returns through a 12-step status workflow from creation to completion.",
  "returns.step2.detail": "Go to Returns > List to see all returns. Click a return to view its details including items, customer info, timeline, and inspection notes. Update the status using the status dropdown — each transition is logged in the timeline. You can approve, reject, process refunds, or mark as completed.",
  "returns.step3.title": "Customer Management",
  "returns.step3.description": "Maintain customer profiles with return history, risk scores, and tags.",
  "returns.step3.detail": "Navigate to Returns > Customers to see your customer directory. Each customer profile shows return statistics, risk score (0-100), addresses, and communication history. Use tags to segment customers (e.g., 'VIP', 'frequent returner') and risk scores to flag potential abuse.",
  "returns.step4.title": "Ticket System",
  "returns.step4.description": "Handle customer inquiries with a full-featured ticket system including SLA tracking.",
  "returns.step4.detail": "Go to Returns > Tickets to manage support tickets. Switch between list and Kanban board views. Each ticket tracks priority, category, assignee, SLA countdown, and the full message thread. Use internal notes (invisible to customers) for team communication. Canned responses speed up common replies.",
  "returns.step5.title": "Visual Email Template Editor",
  "returns.step5.description": "Design beautiful transactional emails with a drag-and-drop editor.",
  "returns.step5.detail": "Navigate to Returns > Email Templates. Choose from 15 pre-built templates (return confirmations, status updates, ticket replies, etc.) or create custom ones. The split-pane editor has 9 block types (text, button, divider, spacer, info-box, image, social links, columns, hero). Live preview updates as you edit. All templates support EN and DE locales.",
  "returns.step6.title": "Workflow Automation",
  "returns.step6.description": "Create automation rules with a visual node-graph builder to streamline operations.",
  "returns.step6.detail": "Go to Returns > Workflows and click 'New Rule'. The visual builder lets you create trigger-condition-action flows. For example: 'When a return is created AND customer risk score > 80, THEN set priority to urgent AND assign to senior agent'. Supports 6 trigger types, 13 condition operators, and 21 action types.",
  "returns.step7.title": "Reports and Analytics",
  "returns.step7.description": "Generate detailed reports on return patterns, processing times, and costs.",
  "returns.step7.detail": "Navigate to Returns > Reports for comprehensive analytics. View return volume trends, top return reasons, average processing times, refund totals, and customer satisfaction metrics. Use filters to drill down by date range, product, reason, or status.",
  "returns.step8.title": "Returns Settings",
  "returns.step8.description": "Configure return reasons, notifications, SLAs, and portal branding across 7 settings tabs.",
  "returns.step8.detail": "Go to Returns > Settings to configure: General (enable/disable, prefix, default solution), Return Reasons (categories with subcategories and follow-up questions), License (plan management), Branding (colors, logo, portal URLs), Tickets/SLA (response and resolution targets, canned responses), Notifications (email sender, locale), and Customer Portal (features, security, branding overrides).",
  "returns.tip1": "Set up workflow rules for common scenarios first — automatic priority assignment based on customer risk score can save hours of manual triage.",
  "returns.tip2": "Use the Kanban board view for tickets when you need a visual overview of your team's workload across status columns.",
  "returns.important1": "The Returns Hub requires a Returns Hub module subscription (Starter, Professional, or Business). Check Settings > Billing to activate the appropriate tier for your needs.",
  "returns.shortcut1": "Use Ctrl+S / Cmd+S to save email templates while editing in the visual editor.",
  "returns.estimatedTime": "25",
  "returns.link": "/returns",

  "portals.title": "Customer & Supplier Portals",
  "portals.subtitle": "Self-service portals for customers to manage returns and suppliers to register",
  "portals.step1.title": "Customer Portal Overview",
  "portals.step1.description": "The Customer Portal lets your end-customers log in, create returns, and track tickets.",
  "portals.step1.detail": "Customers access the portal at /customer/{your-slug}/login. They can self-register or receive an invitation. Once logged in, they see a dashboard with their return history, open tickets, and profile settings. Enable or disable portal features in Returns > Settings > Customer Portal.",
  "portals.step2.title": "Customer Self-Registration",
  "portals.step2.description": "Customers can create their own accounts with email verification or magic link login.",
  "portals.step2.detail": "When self-registration is enabled, customers visit /customer/{your-slug}/register to create an account. You can require email verification, enable magic link login (passwordless), and configure maximum login attempts. The registration form collects name, email, and password.",
  "portals.step3.title": "Public Return Registration Wizard",
  "portals.step3.description": "A 7-step self-service wizard for customers to submit returns without logging in.",
  "portals.step3.detail": "The public return wizard at /returns/register/{your-slug} guides customers through: Identification (order number + email), Select Items (add items with condition), Return Reason (category + follow-up questions), Photo Upload (drag-drop condition photos), Desired Solution (refund/exchange/voucher/repair), Shipping (method + address), and Confirmation (review + submit).",
  "portals.step4.title": "Customer Ticket Management",
  "portals.step4.description": "Customers can create and track support tickets through their portal.",
  "portals.step4.detail": "When the 'View Tickets' and 'Create Tickets' features are enabled, customers see a Tickets section in their portal. They can submit new inquiries, attach files, and track responses. Agent replies appear in the thread, while internal notes remain hidden from customers.",
  "portals.step5.title": "Supplier Registration Flow",
  "portals.step5.description": "Suppliers self-register through a secure 4-step wizard after receiving an invitation.",
  "portals.step5.detail": "On the Suppliers page, click 'Invite Supplier' and enter their email. Copy and share the generated invitation link. The supplier completes a 4-step wizard: Company Basics (name, type, contact), Address (billing + shipping), Legal & Banking (tax, VAT, IBAN), and Business Details (industry, certifications). The invitation expires after the configured number of days.",
  "portals.step6.title": "Supplier Approval Workflow",
  "portals.step6.description": "Review and approve or reject supplier registrations before they become active.",
  "portals.step6.detail": "After a supplier submits their registration, they appear in the 'Pending Approval' section on the Suppliers page. Review their submitted information, then click 'Approve' to activate them or 'Reject' with an optional reason. Approved suppliers can be assigned to products and supply chain entries.",
  "portals.tip1": "Set up your return reasons with detailed subcategories and follow-up questions before launching the public portal — this ensures you collect the right information from customers upfront.",
  "portals.important1": "The Customer Portal requires both a Returns Hub module and the Customer Portal add-on module. The Supplier Portal is a separate add-on available to Pro and Enterprise plans.",
  "portals.estimatedTime": "15",
  "portals.link": "/returns/settings",

  "settings.title": "Settings & Configuration",
  "settings.subtitle": "Configure your organization, branding, team, and integrations",
  "settings.step1.title": "Company Settings",
  "settings.step1.description": "Set up your organization's basic information and tenant configuration.",
  "settings.step1.detail": "Navigate to Settings > Company to configure your organization name, slug (used in portal URLs), contact information, and default language. The tenant slug appears in customer portal and return portal URLs, so choose something short and recognizable.",
  "settings.step2.title": "Branding and Theming",
  "settings.step2.description": "Customize your brand appearance across DPP pages, portals, and emails.",
  "settings.step2.detail": "Go to Settings > Branding to upload your logo and favicon, set a primary brand color (applied as CSS variable across all pages), configure the DPP template and design settings, and set the document title. Changes take effect immediately through the runtime theming system.",
  "settings.step3.title": "User Management",
  "settings.step3.description": "Invite team members and manage their roles and permissions.",
  "settings.step3.detail": "Navigate to Settings > Users to see your team. Click 'Invite User' to send an invitation email with a role assignment. Available roles include Admin and standard user. Invited users receive a link to set up their account. You can cancel pending invitations or remove existing users.",
  "settings.step4.title": "Custom Domain Setup",
  "settings.step4.description": "Serve your customer and returns portals under your own domain with white-label branding.",
  "settings.step4.detail": "In Returns > Settings, find the Portal Domain section and click 'Set up Custom Domain'. The 4-step wizard guides you through: entering your domain (e.g., returns.company.de), selecting your DNS provider (8 providers with specific instructions), adding a CNAME record pointing to cname.vercel-dns.com, and verifying DNS propagation. Once verified, your portal works without any tenant slug in the URL.",
  "settings.step5.title": "White-Label Portal Experience",
  "settings.step5.description": "When a custom domain is active, portals render with your branding and slug-free URLs.",
  "settings.step5.detail": "Customers visiting your custom domain see a fully branded experience: your logo, colors, and company name — with no mention of Trackbliss (unless 'Powered by' is enabled). Routes become clean: / for the returns portal, /portal for the customer portal, /register for return registration.",
  "settings.step6.title": "API Keys",
  "settings.step6.description": "Manage API keys for external integrations and third-party access.",
  "settings.step6.detail": "Navigate to Settings > API Keys to create and manage API credentials. Each key has a name, creation date, and can be revoked at any time. Use API keys for integrating Trackbliss data with your ERP, PIM, or other business systems.",
  "settings.tip1": "Set up branding before launching any public-facing portals — consistent brand presentation builds trust with customers and supply chain partners.",
  "settings.important1": "Your tenant slug is used in all portal URLs. Changing it after sharing portal links with customers will break existing bookmarks and saved links.",
  "settings.note1": "Custom domain setup requires adding a CNAME DNS record. DNS propagation can take up to 48 hours, though most providers propagate within minutes.",
  "settings.estimatedTime": "15",
  "settings.link": "/settings/company",

  "billing.title": "Billing & Subscription",
  "billing.subtitle": "Manage your plan, add-on modules, AI credits, and invoices",
  "billing.step1.title": "Understanding Plans",
  "billing.step1.description": "Trackbliss offers three plans: Free, Pro (€49/mo), and Enterprise (€149/mo).",
  "billing.step1.detail": "Navigate to Settings > Billing to see plan comparison. Free includes 5 products, 3 AI credits/month, and 3 DPP templates. Pro unlocks 50 products, 25 AI credits, all 11 templates, and access to add-on modules. Enterprise provides unlimited products, 100 AI credits, custom CSS for templates, and the highest limits. Annual billing saves 20%.",
  "billing.step2.title": "Add-on Modules",
  "billing.step2.description": "Extend functionality with modular add-ons for returns, supplier portal, customer portal, and custom domains.",
  "billing.step2.detail": "The Modules section shows available add-ons: Returns Hub Starter (€29/mo), Returns Hub Professional (€69/mo), Returns Hub Business (€149/mo), Supplier Portal (€19/mo), Customer Portal (€29/mo), and Custom Domain/White-Label (€19/mo). Some modules require specific plans — dependencies are clearly indicated on each card.",
  "billing.step3.title": "AI Credits System",
  "billing.step3.description": "AI features consume credits — monthly credits reset each billing cycle, purchased credits never expire.",
  "billing.step3.detail": "Your credit balance shows monthly and purchased credits separately. An AI Compliance Check costs 3 credits (one per phase). Other AI features (Overall Assessment, Action Plan, Additional Requirements, Chat) cost 1 credit each. When monthly credits run out, purchased credits are used. Buy credit packs: Small (50 for €9), Medium (200 for €29), or Large (500 for €59).",
  "billing.step4.title": "Managing Your Subscription",
  "billing.step4.description": "Upgrade, downgrade, or manage payment methods through Stripe.",
  "billing.step4.detail": "Click 'Upgrade' on any plan card to start a Stripe checkout session. For existing subscriptions, click 'Manage Subscription' to open the Stripe Customer Portal where you can update payment methods, view invoices, or cancel. When downgrading, all data is preserved — only new resource creation is limited.",
  "billing.step5.title": "Quotas and Usage",
  "billing.step5.description": "Monitor your resource usage against plan limits to avoid hitting quotas.",
  "billing.step5.detail": "Usage bars throughout the app show your current consumption: products, batches per product, admin users, documents, and storage. Bars turn amber at 80% and red at 100%. When a quota is reached, the creation button is disabled with a clear message showing current/limit and an upgrade link. All existing data remains accessible even at quota limits.",
  "billing.tip1": "Start with the Free plan to explore Trackbliss, then upgrade to Pro when you need more than 5 products or want to use the Returns Hub modules.",
  "billing.important1": "Monthly AI credits reset at the start of each billing cycle and do not roll over. Purchased credit packs never expire and are consumed only after monthly credits are depleted.",
  "billing.note1": "When downgrading your plan, all existing data is preserved. Only the creation of new resources is limited to the lower plan's quotas.",
  "billing.estimatedTime": "10",
  "billing.link": "/settings/billing"
}